-- Тестовая БД для ДЗ 5
USE dz5;

-- Создаем тестовые таблицы

DROP TABLE IF EXISTS `storehouses_products`;
CREATE TABLE `storehouses_products` (
  `value` int DEFAULT NULL
);
INSERT INTO `storehouses_products` VALUES (0),(5),(10),(0),(6),(0),(34);


DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL,
  `birthday` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
);
INSERT INTO `users` VALUES (1,'Dr. Darian Bashirian DDS','2017-10-20 08:10:00','1976-05-04 11:57:00','2017-10-20 08:10:00'),(2,'Kavon Hudson III','1971-08-26 11:08:00','1972-04-27 05:59:00','1971-08-26 11:08:00'),(3,'Isac Price','2009-11-11 11:21:00','1973-06-23 21:51:00','2009-11-11 11:21:00'),(4,'Xzavier Cremin','1996-08-01 01:49:00','2004-07-31 00:29:00','1996-08-01 01:49:00'),(5,'Wilton Boyer','1995-05-17 11:44:00','1970-12-01 22:58:00','1995-05-17 11:44:00'),(6,'Miller Leannon','1981-02-24 03:15:00','1985-05-13 09:45:00','1981-02-24 03:15:00'),(7,'Stefanie Kutch','1989-09-23 23:59:00','1997-08-28 00:05:00','1989-09-23 23:59:00'),(8,'Norval Conn','2014-02-13 10:35:00','2013-04-05 23:54:00','2014-02-13 10:35:00'),(9,'Dr. Lessie Reinger III','2007-09-08 05:28:00','1977-07-11 19:52:00','2007-09-08 05:28:00'),(10,'Estefania Legros','1993-05-29 07:05:00','1991-10-17 20:21:00','1993-05-29 07:05:00'),(11,'Wilbert Heathcote','2022-03-04 23:20:00','1995-12-21 20:04:00','2022-03-04 23:20:00'),(12,'Roman Mueller','2010-10-04 04:46:00','1980-09-13 18:10:00','2010-10-04 04:46:00'),(13,'Prof. Maude Kuhn','1979-11-19 06:27:00','2013-01-27 08:08:00','1979-11-19 06:27:00'),(14,'Mr. Geovany Corkery','1978-10-24 18:38:00','1995-01-23 04:50:00','1978-10-24 18:38:00'),(15,'Ivory Harber','1979-03-26 17:17:00','1978-06-03 05:20:00','1979-03-26 17:17:00'),(16,'Cathryn Dibbert','1979-09-04 02:31:00','1988-11-11 15:50:00','1979-09-04 02:31:00'),(17,'Priscilla Boehm','2021-12-19 00:44:00','1995-12-29 01:54:00','2021-12-19 00:44:00'),(18,'Rosemarie McKenzie','1978-12-21 00:09:00','1980-12-01 01:06:00','1978-12-21 00:09:00'),(19,'Emelia Schmidt','1976-05-23 15:53:00','1998-07-26 02:46:00','1976-05-23 15:53:00'),(20,'Lilliana Mraz','2006-06-22 08:43:00','2009-06-08 14:32:00','2006-06-22 08:43:00'),(21,'Mrs. Miracle Jerde','1987-03-10 19:21:00','1975-10-20 20:21:00','1987-03-10 19:21:00'),(22,'Tanner Mitchell','1972-11-29 00:24:00','2005-03-16 13:08:00','1972-11-29 00:24:00'),(23,'Dr. Maude Stroman V','2016-09-28 21:36:00','1979-10-02 15:13:00','2016-09-28 21:36:00'),(24,'Prof. Deborah VonRueden II','1984-10-26 01:38:00','1980-10-15 20:39:00','1984-10-26 01:38:00'),(25,'Raina Feil','2021-11-15 19:23:00','2021-05-03 03:38:00','2021-11-15 19:23:00'),(26,'Dr. Kenny Doyle Jr.','1997-12-28 08:34:00','2015-07-28 05:13:00','1997-12-28 08:34:00'),(27,'Mr. Imani Larson','1972-05-06 22:53:00','1977-03-26 12:29:00','1972-05-06 22:53:00'),(28,'Dr. Burley Metz Sr.','1975-06-12 06:32:00','2009-08-28 14:41:00','1975-06-12 06:32:00'),(29,'Mrs. Madisyn Schoen','1975-10-07 08:30:00','2017-09-08 13:40:00','1975-10-07 08:30:00'),(30,'Finn Kling','2010-04-23 01:53:00','1977-12-31 08:41:00','2010-04-23 01:53:00'),(31,'Dr. Cassidy Douglas','2003-08-23 04:16:00','1992-02-07 18:23:00','2003-08-23 04:16:00'),(32,'Dr. Gaylord Cole III','2013-04-05 12:16:00','1996-08-08 14:57:00','2013-04-05 12:16:00'),(33,'Mr. Dayne DuBuque','1970-02-11 12:37:00','2013-05-25 23:44:00','1970-02-11 12:37:00'),(34,'Shany O\'Connell Jr.','2001-04-09 10:09:00','2004-08-01 23:58:00','2001-04-09 10:09:00'),(35,'Stone McClure','1975-07-11 17:46:00','1971-10-16 14:29:00','1975-07-11 17:46:00'),(36,'Prince Koch','2015-02-03 03:15:00','2007-12-31 19:10:00','2015-02-03 03:15:00'),(37,'Nya Ward','1986-11-30 01:29:00','2015-06-15 05:54:00','1986-11-30 01:29:00'),(38,'Noemy Nienow Sr.','1992-05-29 13:08:00','1974-06-21 19:43:00','1992-05-29 13:08:00'),(39,'Prof. Joelle Greenholt','2013-07-24 00:25:00','1979-07-08 13:08:00','2013-07-24 00:25:00'),(40,'Beau Ziemann','2018-01-16 13:32:00','1995-07-04 11:56:00','2018-01-16 13:32:00'),(41,'Rigoberto Cummerata V','1991-08-02 12:01:00','1970-05-03 17:22:00','1991-08-02 12:01:00'),(42,'Susanna Becker','1988-08-16 06:19:00','1996-10-14 06:15:00','1988-08-16 06:19:00'),(43,'Serenity Kuhn','1985-07-23 20:25:00','1985-01-08 01:45:00','1985-07-23 20:25:00'),(44,'Dr. Elisha Predovic MD','1979-06-29 23:19:00','2006-02-07 08:52:00','1979-06-29 23:19:00'),(45,'Khalil Herzog','1996-10-27 00:02:00','1999-04-22 00:16:00','1996-10-27 00:02:00'),(46,'Golden Roob','2015-06-20 06:32:00','2009-07-16 15:34:00','2015-06-20 06:32:00'),(47,'Mr. Reagan Mertz Jr.','2014-12-04 11:20:00','1994-07-28 11:59:00','2014-12-04 11:20:00'),(48,'Susana Greenholt IV','2006-12-10 08:01:00','2020-04-10 13:18:00','2006-12-10 08:01:00'),(49,'Aurelio Altenwerth','2022-06-30 03:17:00','1981-04-20 12:56:00','2022-06-30 03:17:00'),(50,'Prof. Bailey Armstrong I','2012-09-28 13:27:00','1972-04-18 03:47:00','2012-09-28 13:27:00'),(51,'Kiana Carroll','2009-07-14 17:09:00','2003-11-02 05:21:00','2009-07-14 17:09:00'),(52,'Ms. Deanna Kihn DVM','2006-06-19 13:01:00','1979-06-12 13:07:00','2006-06-19 13:01:00'),(53,'Zachariah Russel','1985-03-04 06:35:00','1972-06-21 03:16:00','1985-03-04 06:35:00'),(54,'Paige Baumbach','2010-01-09 22:11:00','2019-08-28 15:02:00','2010-01-09 22:11:00'),(55,'Prof. Keyon Ernser V','1996-08-25 02:21:00','1974-01-23 08:11:00','1996-08-25 02:21:00'),(56,'Cleora Lakin','1983-12-30 14:44:00','1992-02-27 07:09:00','1983-12-30 14:44:00'),(57,'Jody Harvey','2008-06-04 01:52:00','2010-02-07 17:20:00','2008-06-04 01:52:00'),(58,'Judge Sauer','1972-12-30 06:21:00','2005-04-30 13:12:00','1972-12-30 06:21:00'),(59,'Estefania West I','2019-07-10 20:14:00','2002-07-19 09:43:00','2019-07-10 20:14:00'),(60,'Name Quitzon','1980-03-27 15:08:00','1998-10-23 09:27:00','1980-03-27 15:08:00'),(61,'Soledad Donnelly','2017-04-01 02:29:00','2017-04-02 15:54:00','2017-04-01 02:29:00'),(62,'Melvina Friesen','1991-10-14 06:03:00','2000-08-26 17:24:00','1991-10-14 06:03:00'),(63,'Uriel Kunze Sr.','1986-12-22 00:00:00','1985-07-14 05:38:00','1986-12-22 00:00:00'),(64,'Mr. Alan Kerluke','1994-05-16 02:20:00','1974-07-25 03:41:00','1994-05-16 02:20:00'),(65,'Raoul Altenwerth','2017-05-12 22:16:00','1978-01-17 19:01:00','2017-05-12 22:16:00'),(66,'Simone Zieme','1971-07-20 23:26:00','2004-11-13 02:16:00','1971-07-20 23:26:00'),(67,'Francisca Grant PhD','2010-11-20 00:05:00','1978-10-24 13:44:00','2010-11-20 00:05:00'),(68,'Virgie Muller','1988-12-04 04:58:00','1971-12-12 10:45:00','1988-12-04 04:58:00'),(69,'Ms. Lilly O\'Connell','1971-04-04 16:04:00','1984-10-03 16:11:00','1971-04-04 16:04:00'),(70,'Caroline Wintheiser','1992-10-03 20:26:00','2008-09-24 19:44:00','1992-10-03 20:26:00'),(71,'Frank Ebert','1989-02-07 12:03:00','2016-04-11 19:42:00','1989-02-07 12:03:00'),(72,'Ms. Adeline Schaefer','1980-03-06 16:22:00','2005-07-31 03:50:00','1980-03-06 16:22:00'),(73,'Laila Emmerich','1990-03-03 05:58:00','1972-02-29 03:17:00','1990-03-03 05:58:00'),(74,'Theresia Nienow','2001-08-28 20:20:00','1998-01-23 07:10:00','2001-08-28 20:20:00'),(75,'Jeffery Botsford MD','1970-01-03 08:47:00','1972-11-17 22:31:00','1970-01-03 08:47:00'),(76,'Tavares Gorczany','1986-01-11 23:12:00','1980-10-31 01:25:00','1986-01-11 23:12:00'),(77,'Jaylan Ledner','1990-12-12 15:00:00','2005-02-04 07:36:00','1990-12-12 15:00:00'),(78,'Kenya Lowe MD','1995-05-27 01:57:00','1980-09-23 18:12:00','1995-05-27 01:57:00'),(79,'Vida Emard','2011-05-08 17:46:00','2017-09-17 06:31:00','2011-05-08 17:46:00'),(80,'Arlie Weber','2004-02-25 09:28:00','1979-07-25 21:38:00','2004-02-25 09:28:00'),(81,'Lacy Trantow','2000-07-01 11:33:00','2002-08-09 20:49:00','2000-07-01 11:33:00'),(82,'Ismael Keebler','1984-07-23 02:28:00','2001-04-02 14:45:00','1984-07-23 02:28:00'),(83,'Dr. Tremaine Baumbach I','1993-02-21 18:53:00','2000-01-02 13:35:00','1993-02-21 18:53:00'),(84,'Susan Adams','2003-09-30 14:15:00','2015-09-29 08:48:00','2003-09-30 14:15:00'),(85,'Rosalyn Cummings','1976-02-02 11:48:00','1979-01-23 15:03:00','1976-02-02 11:48:00'),(86,'Carolyn Harber III','1970-10-24 02:07:00','1974-09-27 19:56:00','1970-10-24 02:07:00'),(87,'Mathilde Eichmann','1991-01-26 11:53:00','1986-02-09 03:24:00','1991-01-26 11:53:00'),(88,'Nolan Adams III','1983-03-11 06:28:00','2012-11-18 07:50:00','1983-03-11 06:28:00'),(89,'Jett Hills','2016-10-09 06:41:00','2015-09-09 17:03:00','2016-10-09 06:41:00'),(90,'Tyrese Schmeler III','2005-07-09 21:03:00','1972-10-11 14:42:00','2005-07-09 21:03:00'),(91,'Regan Turcotte','2013-06-23 13:10:00','1986-02-11 11:53:00','2013-06-23 13:10:00'),(92,'Dr. Wendell Pagac','1977-07-04 10:57:00','1974-05-09 19:03:00','1977-07-04 10:57:00'),(93,'Deshaun Jones','1990-05-07 01:54:00','1980-10-31 18:13:00','1990-05-07 01:54:00'),(94,'Georgette Padberg','1985-12-14 08:23:00','1970-09-15 07:54:00','1985-12-14 08:23:00'),(95,'Prof. Tito Franecki PhD','1977-04-25 11:05:00','2019-01-04 09:56:00','1977-04-25 11:05:00'),(96,'Jonas Bayer','1991-08-09 22:40:00','2004-10-10 11:43:00','1991-08-09 22:40:00'),(97,'Loren Skiles','2004-09-09 10:15:00','2010-10-04 07:29:00','2004-09-09 10:15:00'),(98,'Emory Connelly','1999-03-13 01:46:00','2017-08-20 14:59:00','1999-03-13 01:46:00'),(99,'Mariana Lemke DDS','1995-05-30 05:32:00','1994-02-13 11:01:00','1995-05-30 05:32:00'),(100,'Ardith Von','2011-09-20 23:28:00','1971-01-21 09:55:00','2011-09-20 23:28:00');

DROP TABLE IF EXISTS `catalogs`;
CREATE TABLE `catalogs` (
  `id` int(9) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  PRIMARY KEY (`id`)
);
INSERT INTO `catalogs` VALUES (1,'Товар 1'),(2,'Товар 2'),(3,'Товар 3'),(4,'Товар 4'),(5,'Товар 5'),(6,'Товар 6');

-- Неправильная users для второго задания
DROP TABLE IF EXISTS `users2`;
CREATE TABLE `users2` (
  `id` int(9) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `created_at` varchar(100) DEFAULT NULL,
  `updated_at` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
);
INSERT INTO `users2` VALUES (1,'Dr. Darian Bashirian DDS','21.02.1985 14:41','04.05.1976 11:57'),(2,'Kavon Hudson III','26.08.1971 11:08','27.04.1972 05:59'),(3,'Isac Price','11.11.2009 11:21','23.06.1973 21:51'),(4,'Xzavier Cremin','01.08.1996 01:49','31.07.2004 00:29'),(5,'Wilton Boyer','17.05.1995 11:44','01.12.1970 22:58'),(6,'Miller Leannon','24.02.1981 03:15','13.05.1985 09:45'),(7,'Stefanie Kutch','23.09.1989 23:59','28.08.1997 00:05'),(8,'Norval Conn','13.02.2014 10:35','05.04.2013 23:54'),(9,'Dr. Lessie Reinger III','08.09.2007 05:28','11.07.1977 19:52'),(10,'Estefania Legros','29.05.1993 07:05','17.10.1991 20:21'),(11,'Wilbert Heathcote','04.03.2022 23:20','21.12.1995 20:04'),(12,'Roman Mueller','04.10.2010 04:46','13.09.1980 18:10'),(13,'Prof. Maude Kuhn','19.11.1979 06:27','27.01.2013 08:08'),(14,'Mr. Geovany Corkery','24.10.1978 18:38','23.01.1995 04:50'),(15,'Ivory Harber','26.03.1979 17:17','03.06.1978 05:20'),(16,'Cathryn Dibbert','04.09.1979 02:31','11.11.1988 15:50'),(17,'Priscilla Boehm','19.12.2021 00:44','29.12.1995 01:54'),(18,'Rosemarie McKenzie','21.12.1978 00:09','01.12.1980 01:06'),(19,'Emelia Schmidt','23.05.1976 15:53','26.07.1998 02:46'),(20,'Lilliana Mraz','22.06.2006 08:43','08.06.2009 14:32'),(21,'Mrs. Miracle Jerde','10.03.1987 19:21','20.10.1975 20:21'),(22,'Tanner Mitchell','29.11.1972 00:24','16.03.2005 13:08'),(23,'Dr. Maude Stroman V','28.09.2016 21:36','02.10.1979 15:13'),(24,'Prof. Deborah VonRueden II','26.10.1984 01:38','15.10.1980 20:39'),(25,'Raina Feil','15.11.2021 19:23','03.05.2021 03:38'),(26,'Dr. Kenny Doyle Jr.','28.12.1997 08:34','28.07.2015 05:13'),(27,'Mr. Imani Larson','06.05.1972 22:53','26.03.1977 12:29'),(28,'Dr. Burley Metz Sr.','12.06.1975 06:32','28.08.2009 14:41'),(29,'Mrs. Madisyn Schoen','07.10.1975 08:30','08.09.2017 13:40'),(30,'Finn Kling','23.04.2010 01:53','31.12.1977 08:41'),(31,'Dr. Cassidy Douglas','23.08.2003 04:16','07.02.1992 18:23'),(32,'Dr. Gaylord Cole III','05.04.2013 12:16','08.08.1996 14:57'),(33,'Mr. Dayne DuBuque','11.02.1970 12:37','25.05.2013 23:44'),(34,'Shany O\'Connell Jr.','09.04.2001 10:09','01.08.2004 23:58'),(35,'Stone McClure','11.07.1975 17:46','16.10.1971 14:29'),(36,'Prince Koch','03.02.2015 03:15','31.12.2007 19:10'),(37,'Nya Ward','30.11.1986 01:29','15.06.2015 05:54'),(38,'Noemy Nienow Sr.','29.05.1992 13:08','21.06.1974 19:43'),(39,'Prof. Joelle Greenholt','24.07.2013 00:25','08.07.1979 13:08'),(40,'Beau Ziemann','16.01.2018 13:32','04.07.1995 11:56'),(41,'Rigoberto Cummerata V','02.08.1991 12:01','03.05.1970 17:22'),(42,'Susanna Becker','16.08.1988 06:19','14.10.1996 06:15'),(43,'Serenity Kuhn','23.07.1985 20:25','08.01.1985 01:45'),(44,'Dr. Elisha Predovic MD','29.06.1979 23:19','07.02.2006 08:52'),(45,'Khalil Herzog','27.10.1996 00:02','22.04.1999 00:16'),(46,'Golden Roob','20.06.2015 06:32','16.07.2009 15:34'),(47,'Mr. Reagan Mertz Jr.','04.12.2014 11:20','28.07.1994 11:59'),(48,'Susana Greenholt IV','10.12.2006 08:01','10.04.2020 13:18'),(49,'Aurelio Altenwerth','30.06.2022 03:17','20.04.1981 12:56'),(50,'Prof. Bailey Armstrong I','28.09.2012 13:27','18.04.1972 03:47'),(51,'Kiana Carroll','14.07.2009 17:09','02.11.2003 05:21'),(52,'Ms. Deanna Kihn DVM','19.06.2006 13:01','12.06.1979 13:07'),(53,'Zachariah Russel','04.03.1985 06:35','21.06.1972 03:16'),(54,'Paige Baumbach','09.01.2010 22:11','28.08.2019 15:02'),(55,'Prof. Keyon Ernser V','25.08.1996 02:21','23.01.1974 08:11'),(56,'Cleora Lakin','30.12.1983 14:44','27.02.1992 07:09'),(57,'Jody Harvey','04.06.2008 01:52','07.02.2010 17:20'),(58,'Judge Sauer','30.12.1972 06:21','30.04.2005 13:12'),(59,'Estefania West I','10.07.2019 20:14','19.07.2002 09:43'),(60,'Name Quitzon','27.03.1980 15:08','23.10.1998 09:27'),(61,'Soledad Donnelly','01.04.2017 02:29','02.04.2017 15:54'),(62,'Melvina Friesen','14.10.1991 06:03','26.08.2000 17:24'),(63,'Uriel Kunze Sr.','22.12.1986 00:00','14.07.1985 05:38'),(64,'Mr. Alan Kerluke','16.05.1994 02:20','25.07.1974 03:41'),(65,'Raoul Altenwerth','12.05.2017 22:16','17.01.1978 19:01'),(66,'Simone Zieme','20.07.1971 23:26','13.11.2004 02:16'),(67,'Francisca Grant PhD','20.11.2010 00:05','24.10.1978 13:44'),(68,'Virgie Muller','04.12.1988 04:58','12.12.1971 10:45'),(69,'Ms. Lilly O\'Connell','04.04.1971 16:04','03.10.1984 16:11'),(70,'Caroline Wintheiser','03.10.1992 20:26','24.09.2008 19:44'),(71,'Frank Ebert','07.02.1989 12:03','11.04.2016 19:42'),(72,'Ms. Adeline Schaefer','06.03.1980 16:22','31.07.2005 03:50'),(73,'Laila Emmerich','03.03.1990 05:58','29.02.1972 03:17'),(74,'Theresia Nienow','28.08.2001 20:20','23.01.1998 07:10'),(75,'Jeffery Botsford MD','03.01.1970 08:47','17.11.1972 22:31'),(76,'Tavares Gorczany','11.01.1986 23:12','31.10.1980 01:25'),(77,'Jaylan Ledner','12.12.1990 15:00','04.02.2005 07:36'),(78,'Kenya Lowe MD','27.05.1995 01:57','23.09.1980 18:12'),(79,'Vida Emard','08.05.2011 17:46','17.09.2017 06:31'),(80,'Arlie Weber','25.02.2004 09:28','25.07.1979 21:38'),(81,'Lacy Trantow','01.07.2000 11:33','09.08.2002 20:49'),(82,'Ismael Keebler','23.07.1984 02:28','02.04.2001 14:45'),(83,'Dr. Tremaine Baumbach I','21.02.1993 18:53','02.01.2000 13:35'),(84,'Susan Adams','30.09.2003 14:15','29.09.2015 08:48'),(85,'Rosalyn Cummings','02.02.1976 11:48','23.01.1979 15:03'),(86,'Carolyn Harber III','24.10.1970 02:07','27.09.1974 19:56'),(87,'Mathilde Eichmann','26.01.1991 11:53','09.02.1986 03:24'),(88,'Nolan Adams III','11.03.1983 06:28','18.11.2012 07:50'),(89,'Jett Hills','09.10.2016 06:41','09.09.2015 17:03'),(90,'Tyrese Schmeler III','09.07.2005 21:03','11.10.1972 14:42'),(91,'Regan Turcotte','23.06.2013 13:10','11.02.1986 11:53'),(92,'Dr. Wendell Pagac','04.07.1977 10:57','09.05.1974 19:03'),(93,'Deshaun Jones','07.05.1990 01:54','31.10.1980 18:13'),(94,'Georgette Padberg','14.12.1985 08:23','15.09.1970 07:54'),(95,'Prof. Tito Franecki PhD','25.04.1977 11:05','04.01.2019 09:56'),(96,'Jonas Bayer','09.08.1991 22:40','10.10.2004 11:43'),(97,'Loren Skiles','09.09.2004 10:15','04.10.2010 07:29'),(98,'Emory Connelly','13.03.1999 01:46','20.08.2017 14:59'),(99,'Mariana Lemke DDS','30.05.1995 05:32','13.02.1994 11:01'),(100,'Ardith Von','20.09.2011 23:28','21.01.1971 09:55');



/********************************************************
 *  													*
 * БЛОК Операторы, фильтрация, сортировка и ограничение *
 * 														*
 *******************************************************/

/*
* ЗАДАЧА 1
*
* Пусть в таблице users поля created_at и updated_at оказались незаполненными. 
* Заполните их текущими датой и временем.
*
*/


-- Наверное имелось ввиду такое решение
UPDATE users
SET 
	created_at = now(),
	updated_at = now();

-- Но мне оно не нравится, на мой взгляд,
-- лучше разбить на 2 запроса

UPDATE users
SET updated_at = now()
WHERE updated_at IS NULL;

UPDATE users
SET created_at = now()
WHERE created_at IS NULL;

/*
* ЗАДАЧА 2
*
* Таблица users была неудачно спроектирована. 
* Записи created_at и updated_at были заданы типом VARCHAR 
* и в них долгое время помещались значения в формате 20.10.2017 8:10. 
* Необходимо преобразовать поля к типу DATETIME, сохранив введённые ранее значения.
*
*/

UPDATE users2 
SET
	created_at  = str_to_date(created_at, '%d.%m.%Y %H:%i'),
	updated_at = str_to_date(updated_at , '%d.%m.%Y %H:%i');

ALTER TABLE users2 
MODIFY COLUMN created_at DATETIME,
MODIFY COLUMN updated_at DATETIME;

/*
* ЗАДАЧА 3
*
* В таблице складских запасов storehouses_products в поле value 
* могут встречаться самые разные цифры: 0, если товар закончился и выше нуля,
* если на складе имеются запасы. Необходимо отсортировать записи таким образом,
* чтобы они выводились в порядке увеличения значения value. 
* Однако нулевые запасы должны выводиться в конце, после всех записей.
*
*/

-- Интересно, есть ли более изящное решение
SELECT value
FROM storehouses_products
ORDER BY value = 0, value;


/*
* ЗАДАЧА 4
*
* Из таблицы users необходимо извлечь пользователей, родившихся в августе и мае. 
* Месяцы заданы в виде списка английских названий (may, august)
*
*/

SELECT id, name 
FROM  users
WHERE  DATE_FORMAT(birthday, '%M') IN ('may', 'august');

/*
* ЗАДАЧА 5
*
* Из таблицы catalogs извлекаются записи при помощи запроса. 
* SELECT * FROM catalogs WHERE id IN (5, 1, 2); 
* Отсортируйте записи в порядке, заданном в списке IN.
*
*/

SELECT * 
FROM catalogs 
WHERE id IN (5, 1, 2)
ORDER BY FIELD(id, 5, 1, 2);

/********************************************************
 *  													*
 * БЛОК Агрегация данных							    *
 * 														*
 *******************************************************/

/*
* ЗАДАЧА 1
*
* Подсчитайте средний возраст пользователей в таблице users
*
*/

SELECT AVG(TIMESTAMPDIFF(YEAR, birthday, NOW())) AS avg_age
FROM users;


/*
* ЗАДАЧА 2
*
* Подсчитайте количество дней рождения, которые приходятся на каждый из дней недели. 
* Следует учесть, что необходимы дни недели текущего года, а не года рождения
*
*/

-- Не слишком ли я усложнил?
SELECT 
	DATE_FORMAT( CONCAT(YEAR(NOW()), DATE_FORMAT(birthday, '-%m-%d')), '%W') AS  dw,
	COUNT(birthday) AS cnt
FROM users 
GROUP BY dw
ORDER BY cnt DESC ;

/*
* ЗАДАЧА 3
*
* Подсчитайте произведение чисел в столбце таблицы
*
*/

-- Честно сперто с просторов интернета. Сам бы не додумался

SELECT ROUND(EXP(SUM(LN (value))))
FROM storehouses_products
WHERE value !=0;
